# Credit Risk

##### Entendimento, Preparação, Manipualação e Exploração dos dados

In [2]:
# %config Completer.use_jedi = False

## Import Libraries

In [51]:
## Data manipulation
from dfply import *
import pandas as pd

## Numerical computing
import numpy as np
import sklearn
import warnings

## Plots Graphics 
import matplotlib.pyplot as plt
import seaborn as sns

## firulas em python
import pandas_profiling
from IPython import get_ipython

## work dir
import os

# set parametors
import ipyparams
currentNotebook = ipyparams.notebook_name

## 
warnings.filterwarnings('ignore')
plt.rcParams["patch.force_edgecolor"] = True
%matplotlib inline

In [6]:
# get_ipython().magic('reset -sf')

In [4]:
from IPython.core.display import display, HTML
display(HTML("<style>.container { width:75% !important; }</style>"))

## Objetivos

* Definição da metodologia
* Entendimento do Conjunto de Dados
* Planejamento Amostral

# Cross Industry Standard Process for Data Mining (CRISP-DM)

![Crisp DM](../imagens/crispdm.png)

![alt-text-1](../imagens/overview_tasks_crispdm.PNG)

![Crisp DM](../imagens/crisp_dm_plannning.PNG)

# About Dataset

Abstract: This research aimed at the case of customersâ€™ default payments in Taiwan and compares the predictive accuracy of probability of default among six data mining methods.

<center/>

|       Characteristics     |     Values     |
|:-------------------------:|:--------------:|
| Data Set Characteristics  | Multivariate   | 
| Number of Instances       | 30000          |
| Area                      | Business       |
| Attribute Characteristics | Integer, Real  | 
| Number of Attributes      | 24             | 
| Date Donated              | 2016-01-26     |
| Associated Tasks          | Classification | 
| Missing Values?           | N/A            | 
| Number of Web Hits        | 585684         |

</center>

## Data Set Information

This research aimed at the case of customersâ€™ default payments in Taiwan and compares the predictive accuracy of probability of default among six data mining methods. From the perspective of risk management, the result of predictive accuracy of the estimated probability of default will be more valuable than the binary result of classification - credible or not credible clients. Because the real probability of default is unknown, this study presented the novel â€œSorting Smoothing Methodâ€ to estimate the real probability of default. With the real probability of default as the response variable (Y), and the predictive probability of default as the independent variable (X), the simple linear regression result (Y = A + BX) shows that the forecasting model produced by artificial neural network has the highest coefficient of determination; its regression intercept (A) is close to zero, and regression coefficient (B) to one. Therefore, among the six data mining techniques, artificial neural network is the only one that can accurately estimate the real probability of default.

## Informations sur l'ensemble de données

Cette recherche a porté sur le cas des paiements par défaut des clients à Taïwan et compare l'exactitude prédictive de la probabilité de défaut parmi six méthodes d'exploration de données. Du point de vue de la gestion des risques, le résultat de l'exactitude prédictive de la probabilité de défaut estimée sera plus précieux que le résultat binaire de la classification - clients crédibles ou non crédibles. Parce que la probabilité réelle de défaut est inconnue, cette étude a présenté la nouvelle « méthode de lissage du tri » pour estimer la probabilité réelle de défaut. Avec la probabilité réelle de défaut comme variable de réponse (Y) et la probabilité prédictive de défaut comme variable indépendante (X), le résultat de la régression linéaire simple (Y = A + BX) montre que le modèle de prévision produit par le réseau de neurones artificiels a le coefficient de détermination le plus élevé; son intersection de régression (A) est proche de zéro et son coefficient de régression (B) de un. Par conséquent, parmi les six techniques d'exploration de données, le réseau de neurones artificiels est le seul qui peut estimer avec précision la probabilité réelle de défaut.

## Informations sur l'ensemble de données

Cette recherche a porté sur le cas des paiements par défaut des clients à Taïwan et compare l'exactitude prédictive de la probabilité de défaut parmi six méthodes d'exploration de données. Du point de vue de la gestion des risques, le résultat de l'exactitude prédictive de la probabilité de défaut estimé sera plus précieux que le résultat binaire de la classification - clients crédibles ou non crédibles. Parce que la probabilité réelle de défaut est inconnue, cette étude a présenté la nouvelle « méthode de lissage du tri » pour estimer la probabilité réelle de défaut. Avec la probabilité réelle de défaut comme variable de réponse (Y) et la probabilité prédictive de défaut comme variable indépendante (X), le résultat de la régression linéaire simple (Y = A + BX) montre que le modèle de prévision du produit par le réseau de neurones artificiels à le coefficient de détermination le plus élevé; son intersection de régression (A) est proche de zéro et son coefficient de régression (B) de un. Par conséquent, parmi les six techniques d'exploration de données, le réseau de neurones artificiels est le seul qui peut estimer avec précision la probabilité réelle de défaut.

## Data Set Information

Conjunto de dados é referentes a casos de pagamentos de inadimplência de clientes em Taiwan.  

### Attribute Information

This research employed a binary variable, default payment (Yes = 1, No = 0), as the response variable. This study reviewed the literature and used the following 23 variables as explanatory variables:

- X1: Amount of the given credit (NT dollar): it includes both the individual consumer credit and his/her family (supplementary) credit.
- X2: Gender (1 = male; 2 = female).
- X3: Education (1 = graduate school; 2 = university; 3 = high school; 4 = others).
- X4: Marital status (1 = married; 2 = single; 3 = others).
- X5: Age(year).

- X6 - X11: History of past payment. 
    - We tracked the past monthly payment records (from April to September, 2005) as follows: 
    - X6 = the repayment status in September, 2005; 
    - X7 = the repayment status in August, 2005; . . .;
    - X11 = the repayment status in April, 2005. 
        - The measurement scale for the repayment status is: 
        - -1 = pay duly; 
        - 1 = payment delay for one month; 
        - 2 = payment delay for two months; . . .; 
        - 8 = payment delay for eight months; 
        - 9 = payment delay for nine months and above.

- X12 - X17: Amount of bill statement (NT dollar). 
    - X12 = amount of bill statement in September, 2005; 
    - X13 = amount of bill statement in August, 2005 
    - X17 = amount of bill statement in April, 2005.
    
- X18 - X23: Amount of previous payment (NT dollar). 
    - X18 = amount paid in September, 2005; 
    - X19 = amount paid in August, 2005
    - X23 = amount paid in April, 2005.
    

y
limit_bal
sex
education
marriage
age
pay_0
pay_2
pay_3
pay_4
pay_5
pay_6
bill_amt1
bill_amt2
bill_amt3
bill_amt4
bill_amt5
bill_amt6
pay_amt1
pay_amt2
pay_amt3
pay_amt4
pay_amt5
pay_amt6

- __Default Payment next month (y)__ 
    - Yes = 1
    - No = 0

- __limit_bal: Valor do crédito concedido (dólar NT):__ 
    - crédito ao consumidor 
    - crédito pessoa física 
    - crédito familiar (suplementar)
- __sex:__ 
     - 1 = masculino; 2 = feminino
- __education:__
    - 1 = pós-graduação; 2 = universidade; 3 = ensino médio; 4 = outros
- __marriage:__ 
     - 1 = casado; 2 = solteiro; 3 = outros.
- __age:__ Idade (ano)

    &nbsp;
    
- __Histórico de pagamentos anteriores (de abril a setembro de 2005):__
    - pay_0 = situação de amortização em setembro de 2005
    - pay_1 = situação de amortização em agosto de 2005
    - pay_2 = situação de amortização em julho de 2005
    - pay_3 = situação de amortização em jumho de 2005 
    - pay_4 = situação de amortização em maio de 2005
    - pay_5 = situação de amortização em abril de 2005
    
    &nbsp;
    
- __pay_6: Status de reembolso em abril de 2005__    
    - -1: pagar devidamente;
    -  1: atraso no pagamento por um mês
    -  2: atraso no pagamento por dois meses
    -  3: atraso no pagamento por três meses
    -  4: atraso no pagamento por quatro meses
    -  5: atraso no pagamento por cinco meses
    -  6: atraso no pagamento por seis meses
    -  7: atraso no pagamento por sete meses
    -  8: atraso no pagamento por oito meses
    -  9: atraso no pagamento de nove meses ou mais.
    
    &nbsp;

-  __Valor da fatura (dólar NT).__
    - bill_amt1: valor da fatura em setembro de 2005
    - bill_amt2: valor da fatura em agosto de 2005
    - bill_amt3: valor da fatura em julho de 2005 
    - bill_amt4: valor da fatura em jumho de 2005 
    - bill_amt5: valor da fatura em maio de 2005 
    - bill_amt6: valor da fatura em abril de 2005 

    &nbsp;

- __Valor do pagamento anterior (dólar NT).__
    - pay_amt1: valor pago em setembro de 2005
    - pay_amt2: valor pago em agosto de 2005 
    - pay_amt3: valor pago em julho de 2005 
    - pay_amt4: valor pago em junho de 2005 
    - pay_amt5: valor pago em maio de 2005 
    - pay_amt6: valor pago em abril de 2005

# Working Dataset 

## Read Dataset

In [146]:
df = pd.read_excel('../dados/Aula3_fullDataset.xls',encoding='utf-8',skiprows = [0])

## Show Dataset

In [147]:
df.head()

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
0,1,20000,2,2,1,24,2,2,-1,-1,...,0,0,0,0,689,0,0,0,0,1
1,2,120000,2,2,2,26,-1,2,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,1
2,3,90000,2,2,2,34,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,0
3,4,50000,2,2,1,37,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,0
4,5,50000,1,2,1,57,-1,0,-1,0,...,20940,19146,19131,2000,36681,10000,9000,689,679,0

## Chance Columns Names to Lower() 

Primeiramente é necessário transformar os nomes das colunas para lowercase()

In [148]:
df.columns = df.columns.str.lower()

## Rename Var

here we rename var `default payment next month` to `y`

In [149]:
df = df.rename(columns = {'default payment next month':'y'})

In [150]:
df.head()

,id,limit_bal,sex,education,marriage,age,pay_0,pay_2,pay_3,pay_4,...,bill_amt4,bill_amt5,bill_amt6,pay_amt1,pay_amt2,pay_amt3,pay_amt4,pay_amt5,pay_amt6,y
0,1,20000,2,2,1,24,2,2,-1,-1,...,0,0,0,0,689,0,0,0,0,1
1,2,120000,2,2,2,26,-1,2,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,1
2,3,90000,2,2,2,34,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,0
3,4,50000,2,2,1,37,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,0
4,5,50000,1,2,1,57,-1,0,-1,0,...,20940,19146,19131,2000,36681,10000,9000,689,679,0

# Planejamento do Experimento 

O conjunto de dados de credit score geralmente é segmentado em safras que são janelas temporais cujo objetivo é capturar informações macroeconômicas, principalmente no Brasil, em que há momentos econômicos significativamentes diferentes.    

## Create Var Safra

In [151]:
df['safra'] = np.repeat([200510, 200511, 200512, 200601, 200602, 200603, 200604, 200605,200606, 200607],3000)

## Orderna Colunas

In [169]:
df = df[['id','y','safra', 'limit_bal', 'sex', 'education', 'marriage', 'age', 
            'pay_0','pay_2', 'pay_3', 'pay_4', 'pay_5', 'pay_6', 
            'bill_amt1', 'bill_amt2','bill_amt3', 'bill_amt4', 'bill_amt5', 'bill_amt6', 
            'pay_amt1','pay_amt2', 'pay_amt3', 'pay_amt4', 'pay_amt5', 'pay_amt6']]

In [170]:
df.head()

,id,y,safra,limit_bal,sex,education,marriage,age,pay_0,pay_2,...,bill_amt3,bill_amt4,bill_amt5,bill_amt6,pay_amt1,pay_amt2,pay_amt3,pay_amt4,pay_amt5,pay_amt6
0,1,1,200510,20000,2,2,1,24,2,2,...,689,0,0,0,0,689,0,0,0,0
1,2,1,200510,120000,2,2,2,26,-1,2,...,2682,3272,3455,3261,0,1000,1000,1000,0,2000
2,3,0,200510,90000,2,2,2,34,0,0,...,13559,14331,14948,15549,1518,1500,1000,1000,1000,5000
3,4,0,200510,50000,2,2,1,37,0,0,...,49291,28314,28959,29547,2000,2019,1200,1100,1069,1000
4,5,0,200510,50000,1,2,1,57,-1,0,...,35835,20940,19146,19131,2000,36681,10000,9000,689,679

In [171]:
df.tail()

,id,y,safra,limit_bal,sex,education,marriage,age,pay_0,pay_2,...,bill_amt3,bill_amt4,bill_amt5,bill_amt6,pay_amt1,pay_amt2,pay_amt3,pay_amt4,pay_amt5,pay_amt6
29995,29996,0,200607,220000,1,3,1,39,0,0,...,208365,88004,31237,15980,8500,20000,5003,3047,5000,1000
29996,29997,0,200607,150000,1,3,2,43,-1,-1,...,3502,8979,5190,0,1837,3526,8998,129,0,0
29997,29998,1,200607,30000,1,2,2,37,4,3,...,2758,20878,20582,19357,0,0,22000,4200,2000,3100
29998,29999,1,200607,80000,1,3,1,41,1,-1,...,76304,52774,11855,48944,85900,3409,1178,1926,52964,1804
29999,30000,1,200607,50000,1,2,1,46,0,0,...,49764,36535,32428,15313,2078,1800,1430,1000,1000,1000

## Estratégia de Amostragem 

Geralmente em casos reais os conjuntos de dados para análise de credit score são extratificados em safras. Neste caso iremos adicionar uma variável denominada por safra que irá segmentar nosso conjunto de dados da seguinte forma. 

<center/>

|                                     |           Planejamento Amostral                  |   
|:-----------------------------------:|:------------------------------------------------:|
|![image.png](../imagens/safras.png)  |![image.png](../imagens/planejamento_amostral.PNG)| 

</center>

 Visando tornar a aplicação mais próxima da realidade o conjunto de dados foi segmentado em safras considerando uma volumetria de 3000 observações em cada safra e com isso determinado um ponto de observação em um determinado mês para então fazermos predição para o mês subsequente.

# Transformações de Variáveis

In [201]:
df1 = df.copy()

In [202]:
df1.head()

,id,y,safra,limit_bal,sex,education,marriage,age,pay_0,pay_2,...,bill_amt3,bill_amt4,bill_amt5,bill_amt6,pay_amt1,pay_amt2,pay_amt3,pay_amt4,pay_amt5,pay_amt6
0,1,1,200510,20000,2,2,1,24,2,2,...,689,0,0,0,0,689,0,0,0,0
1,2,1,200510,120000,2,2,2,26,-1,2,...,2682,3272,3455,3261,0,1000,1000,1000,0,2000
2,3,0,200510,90000,2,2,2,34,0,0,...,13559,14331,14948,15549,1518,1500,1000,1000,1000,5000
3,4,0,200510,50000,2,2,1,37,0,0,...,49291,28314,28959,29547,2000,2019,1200,1100,1069,1000
4,5,0,200510,50000,1,2,1,57,-1,0,...,35835,20940,19146,19131,2000,36681,10000,9000,689,679

In [203]:
df1.tail()

,id,y,safra,limit_bal,sex,education,marriage,age,pay_0,pay_2,...,bill_amt3,bill_amt4,bill_amt5,bill_amt6,pay_amt1,pay_amt2,pay_amt3,pay_amt4,pay_amt5,pay_amt6
29995,29996,0,200607,220000,1,3,1,39,0,0,...,208365,88004,31237,15980,8500,20000,5003,3047,5000,1000
29996,29997,0,200607,150000,1,3,2,43,-1,-1,...,3502,8979,5190,0,1837,3526,8998,129,0,0
29997,29998,1,200607,30000,1,2,2,37,4,3,...,2758,20878,20582,19357,0,0,22000,4200,2000,3100
29998,29999,1,200607,80000,1,3,1,41,1,-1,...,76304,52774,11855,48944,85900,3409,1178,1926,52964,1804
29999,30000,1,200607,50000,1,2,1,46,0,0,...,49764,36535,32428,15313,2078,1800,1430,1000,1000,1000

## Criando Novas Variáveis

Criando variáveis da soma, média e valor máximo referentes a fatura e pagamentos do clientes no intervalor de seis meses.

### Fatura (Bill)

In [204]:
df1 = pd.concat([df1,df1[['bill_amt1','bill_amt2','bill_amt3','bill_amt4','bill_amt5','bill_amt6']]
           .agg(['sum','mean','max'], axis = 1)
           .rename(columns = {'sum':'sum_bill','mean':'avg_bill','max':'max_bill'})],axis=1)

### Pagamentos (Pay)

In [207]:
df1 = pd.concat([df1,df1[['pay_amt1', 'pay_amt2', 'pay_amt3', 'pay_amt4', 'pay_amt5', 'pay_amt6']]
           .agg(['sum','mean','max'], axis = 1)
           .rename(columns = {'sum':'sum_pay','mean':'avg_pay','max':'max_pay'})],axis=1)

In [218]:
df1.head()

,id,y,safra,limit_bal,sex,education,marriage,age,pay_0,pay_2,...,pay_amt3,pay_amt4,pay_amt5,pay_amt6,sum_bill,avg_bill,max_bill,sum_pay,avg_pay,max_pay
0,1,1,200510,20000,2,2,1,24,2,2,...,0,0,0,0,7704.0,1284.000000,3913.0,689.0,114.833333,689.0
1,2,1,200510,120000,2,2,2,26,-1,2,...,1000,1000,0,2000,17077.0,2846.166667,3455.0,5000.0,833.333333,2000.0
2,3,0,200510,90000,2,2,2,34,0,0,...,1000,1000,1000,5000,101653.0,16942.166667,29239.0,11018.0,1836.333333,5000.0
3,4,0,200510,50000,2,2,1,37,0,0,...,1200,1100,1069,1000,231334.0,38555.666667,49291.0,8388.0,1398.000000,2019.0
4,5,0,200510,50000,1,2,1,57,-1,0,...,10000,9000,689,679,109339.0,18223.166667,35835.0,59049.0,9841.500000,36681.0

In [206]:
df1.columns

Index(['id', 'y', 'safra', 'limit_bal', 'sex', 'education', 'marriage', 'age',
       'pay_0', 'pay_2', 'pay_3', 'pay_4', 'pay_5', 'pay_6', 'bill_amt1',
       'bill_amt2', 'bill_amt3', 'bill_amt4', 'bill_amt5', 'bill_amt6',
       'pay_amt1', 'pay_amt2', 'pay_amt3', 'pay_amt4', 'pay_amt5', 'pay_amt6',
       'sum_bill', 'avg_bill', 'max_bill'],
      dtype='object')

## Divisão do Dataset

### Dataset OOT

In [211]:
df_oot = df1.loc[df1['safra'] >= 200605]

In [213]:
df_oot['safra'].value_counts()

200606    3000
200607    3000
200605    3000
Name: safra, dtype: int64

### Dataset DEV

In [215]:
df_dev = df1.loc[df1['safra'] < 200605 ]

In [217]:
df_dev['safra'].value_counts()

200510    3000
200511    3000
200604    3000
200602    3000
200603    3000
200601    3000
200512    3000
Name: safra, dtype: int64

### Dataset de Treino e Teste

In [219]:
# import train_test_split
from sklearn.model_selection import train_test_split

In [220]:
X_train, X_test, y_train, y_test = train_test_split(df_dev.drop(columns=['y']), df_dev['y'] ,test_size=0.3, random_state=123)

### Amostras de Treinamento

In [221]:
X_train['safra'].value_counts()

safra
200510    2103
200511    2124
200512    2110
200601    2081
200602    2075
200603    2102
200604    2105
Name: safra, dtype: int64

### Amostras de Teste

In [223]:
X_test['safra'].value_counts()

200602    925
200601    919
200603    898
200510    897
200604    895
200512    890
200511    876
Name: safra, dtype: int64

# Save Amostras

In [225]:
df_oot.to_csv('../output/df_oot.csv')
X_train.to_csv('../output/X_train.csv')
X_test.to_csv('../output/X_test.csv')
y_train.to_csv('../output/y_train.csv')
y_test.to_csv('../output/y_test.csv')